Revit 2027 API
TableData.NumberOfSections Property
 Gets the number of items in section data array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSections { get; }
Public ReadOnly Property NumberOfSections As Integer
	Get
public:
property int NumberOfSections {
	int get ();
}
member NumberOfSections : int with get
Property Value
Int32
See Also
Reference
TableData Class
Autodesk.Revit.DB Namespace